In [4]:
import pandas as pd
technologies={'courses':['python','dbms','java','spark'],
              'fee':[20000,25000,26000,22000],
              'duration':['30days','40days','35days','60days'],
              'discount':[1000,2000,1200,2000]}
df=pd.DataFrame(technologies)
print(df)

  courses    fee duration  discount
0  python  20000   30days      1000
1    dbms  25000   40days      2000
2    java  26000   35days      1200
3   spark  22000   60days      2000

Using groupby fuction in dataframe to find  first and last element of the group

In [5]:
df.groupby('courses').aggregate({'duration':'count','fee':['first','last']})

        duration    fee
           count  first   last
courses
dbms           1  25000  25000
java           1  26000  26000
python         1  20000  20000
spark          1  22000  22000

# Using groupby fuction in dataframe to get count

In [7]:
df.groupby('courses').aggregate({'fee':'count'})

         fee
courses
dbms       1
java       1
python     1
spark      1